In [2]:
import pandas as pd

In [3]:
import seaborn as sns

In [5]:
df = sns.load_dataset("iris")

In [7]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [8]:
df["sepal_length"]

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_length, Length: 150, dtype: float64

In [10]:
names = ['Abhi','Ram','Shaam']
ages = [25,56,45]

In [11]:
d = {
    "name":names,
    "age":ages
}

In [12]:
d

{'name': ['Abhi', 'Ram', 'Shaam'], 'age': [25, 56, 45]}

In [14]:
pd.DataFrame(d)

    name  age
0   Abhi   25
1    Ram   56
2  Shaam   45

In [15]:
import numpy as np

In [16]:
data = np.random.randint(10,20,(10,5))

In [21]:
marks = pd.DataFrame(data,columns=["p","c","r","y","u"])

In [22]:
marks["bio"] = 0

In [23]:
marks

    p   c   r   y   u  bio
0  10  16  10  19  16    0
1  14  12  18  18  12    0
2  16  12  14  11  16    0
3  12  16  18  13  13    0
4  11  11  12  10  11    0
5  12  19  18  14  19    0
6  12  12  18  13  13    0
7  15  19  19  12  15    0
8  16  19  14  18  17    0
9  15  13  11  14  13    0

In [25]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [26]:
df.T

,0,1,2,3,4,5,6,7,8,9,...,140,141,142,143,144,145,146,147,148,149
sepal_length,5.1,4.9,4.7,4.6,5,5.4,4.6,5,4.4,4.9,...,6.7,6.9,5.8,6.8,6.7,6.7,6.3,6.5,6.2,5.9
sepal_width,3.5,3,3.2,3.1,3.6,3.9,3.4,3.4,2.9,3.1,...,3.1,3.1,2.7,3.2,3.3,3,2.5,3,3.4,3
petal_length,1.4,1.4,1.3,1.5,1.4,1.7,1.4,1.5,1.4,1.5,...,5.6,5.1,5.1,5.9,5.7,5.2,5,5.2,5.4,5.1
petal_width,0.2,0.2,0.2,0.2,0.2,0.4,0.3,0.2,0.2,0.1,...,2.4,2.3,1.9,2.3,2.5,2.3,1.9,2,2.3,1.8
species,setosa,setosa,setosa,setosa,setosa,setosa,setosa,setosa,setosa,setosa,...,virginica,virginica,virginica,virginica,virginica,virginica,virginica,virginica,virginica,virginica

In [27]:
marks.sort_index(axis=1)

   bio   c   p   r   u   y
0    0  16  10  10  16  19
1    0  12  14  18  12  18
2    0  12  16  14  16  11
3    0  16  12  18  13  13
4    0  11  11  12  11  10
5    0  19  12  18  19  14
6    0  12  12  18  13  13
7    0  19  15  19  15  12
8    0  19  16  14  17  18
9    0  13  15  11  13  14

In [28]:
marks.sort_values(["p"])

    p   c   r   y   u  bio
0  10  16  10  19  16    0
4  11  11  12  10  11    0
3  12  16  18  13  13    0
5  12  19  18  14  19    0
6  12  12  18  13  13    0
1  14  12  18  18  12    0
7  15  19  19  12  15    0
9  15  13  11  14  13    0
2  16  12  14  11  16    0
8  16  19  14  18  17    0

In [32]:
marks.iloc[[0, 2, 6], [0, 2, 3]]

    p   r   y
0  10  10  19
2  16  14  11
6  12  18  13